{
  "releases": [
    {
      "version": "3.0.3",
      "date": "2026-02-04",
      "notes": [
        "Performance: Enabled PDO persistent connections to eliminate 3+ second database connection overhead",
        "Performance: Added session change detection to skip unnecessary database writes (60-80% reduction)",
        "Performance: Removed leaderboard data from sessions (15-18KB reduction per session)",
        "Performance: Removed friend list from sessions (2-3KB reduction per session)",
        "Overall: 50-70% reduction in response times, session size reduced from 23KB to 2-3KB"
      ]
    },
    {
      "version": "3.0.2",
      "date": "2026-02-04",
      "notes": [
        "Fixed leaderboard friends filter to correctly exclude pending/blocked friends from rank calculations",
        "Added comprehensive tests for weekly and all-time friends scope filtering"
      ]
    },
    {
      "version": "3.0.1",
      "date": "2026-02-04",
      "notes": [
        "Score animation performance hotfix",
        "Faster leaderboard refresh intervals"
      ]
    },
    {
      "version": "3.0.0",
      "date": "2026-02-03",
      "notes": [
        "*** LEADERBOARD 2.0 - A complete redesign of competitive play! ***",
        "",
        "DAILY LEADERBOARD: Play up to 20 games per day. Your best 10 scores are summed into a daily score. Play at least 3 games to qualify for the daily board.",
        "",
        "WEEKLY LEADERBOARD: Your best 5 daily scores each week (Mon-Sun) are combined into a weekly score. Play at least 3 qualifying days to rank.",
        "",
        "ALL-TIME LEADERBOARD: Your career Average Game Score across all eligible games. Play 50+ games to earn your all-time ranking. Best single game score also tracked.",
        "",
        "FEATURED STATS: A new stat highlights each day, rotating through Hot Dice (best single round), Farkle Rate (lowest farkle %), Comeback King (biggest deficit overcome), Hot Streak (win streak), and Consistency (steadiest scorer).",
        "",
        "Friends-first view with rivalry labels, rank movement arrows, and head-to-head cards when playing with 2-3 friends",
        "Post-game toast shows your leaderboard impact after each eligible game",
        "Daily game counter in lobby tracks your progress toward the 20-game cap",
        "Win streak tracking added to player profiles",
        "Solo games and bot games are excluded from leaderboard rankings"
      ]
    },
    {
      "version": "2.8.3",
      "date": "2026-02-02",
      "notes": [
        "NEW: Keyboard shortcuts for desktop players - R to roll, S to score, 1-6 to select dice"
      ]
    },
    {
      "version": "2.8.2",
      "date": "2026-02-02",
      "notes": [
        "UI: Added spacing between action buttons and player cards - apparently 10 whole pixels was simply not enough for some people, Nick"
      ]
    },
    {
      "version": "2.8.1",
      "date": "2026-02-02",
      "notes": [
        "Fixed daily leaderboard timezone bug - evening scores now correctly appear on the right day"
      ]
    },
    {
      "version": "2.8.0",
      "date": "2026-02-01",
      "notes": [
        "Security: Migrated all SQL queries to prepared statements for improved security",
        "Database: Updated database abstraction layer with new helper functions (db_query, db_execute, db_insert)"
      ]
    },
    {
      "version": "2.7.4",
      "date": "2025-02-01",
      "notes": [
        "Fixed Rivalry achievements not being awarded (beat same player 5/15/50 times)"
      ]
    },
    {
      "version": "2.7.0",
      "date": "2026-01-31",
      "headline": "Emoji Reactions!",
      "notes": [
        "🎲 NEW: Send emoji reactions to opponents after games - How'd they roll?",
        "Player cards now display your 'known for' emoji based on reactions received",
        "View your emoji history and most common reaction on your profile",
        "Enhanced My Profile page - larger font, new stats, and better display!"
      ]
    },
    {
      "version": "2.6.0",
      "date": "2025-01-31",
      "notes": [
        "Added Release Notes page accessible from footer",
        "Updated footer version styling for better visibility"
      ]
    },
    {
      "version": "2.5.3",
      "date": "2025-01-30",
      "notes": [
        "Daily leaderboards with Today/Yesterday toggle",
        "Yesterday's MVP section showing top win ratio player",
        "Improved leaderboard UI with segmented toggle buttons"
      ]
    }
  ]
}
